---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SweepFailures.WallSweepInconsistent
source: html/6aebe9d4-f7ca-c1b9-83da-c3d721fbf00e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SweepFailures.WallSweepInconsistent Property

The model contains corrupt elements. Delete the corrupt elements to proceed or cancel the action without deleting the elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallSweepInconsistent { get; }
```